[
	{
		"id": "namiscakes",
		"title": "Nami's Cakes Website",
		"description": [
			"A website I made for a small business which baked beautiful and delicious custom cakes with astonishing decorations. I created the website from scratch using plain HTML, CSS, and JavaScript for the front end, and PHP with SQL for the back end. This was the first full stack website I made."
		],
		"thumbnail": "/images/portfolio/namiscakes-thumb.jpg",
		"images": ["/images/portfolio/namiscakes.jpg"],
		"categories": [
			"Website",
			"Graphic Design",
			"HTML",
			"CSS",
			"JavaScript",
			"PHP",
			"SQL"
		]
	},
	{
		"id": "gbss-hagaddah",
		"title": "GBSS Hagaddah Cover",
		"description": [
			"Every year before Pesach, my high school would make a Haggadah in which each student would collaborate with a different Devar Torah. One year, I was tasked with designing the front cover for this school project. The front cover I designed uses a dark red primary colour to represent the four iconic cups of wine which make up an important part of the Pesach Seder. The rest of the cover is all a light silvery white which alludes to the silver which is traditionally used for the goblets holding the aforementioned four cups, as well as the white tablecloth often used for the Seder table.",
			"Overall, the simplicity of the design gives it a certain elegance which makes the hagaddah look perfectly harmonious on the Seder table."
		],
		"thumbnail": "/images/portfolio/haggada-thumb.jpg",
		"images": [
			"/images/portfolio/haggada-photo.jpg",
			"/images/portfolio/haggada-cover.jpg"
		],
		"categories": ["Graphic Design", "Book Cover"]
	},
	{
		"id": "mami-shula",
		"title": "Mami Shula Nail Salon Business Cards",
		"description": [
			"When a family friend wanted to start her own business, she approached me and asked me if I would like to design her business cards. Having never done any business cards before, and not knowing much about the manicure industry, I nevertheless took on the challenge.",
			"After considering several options, I settled upon a simple vector pattern using nail polish related items overlaying the solid purple background. Over this background, I placed a solid coloured ribbon upon which I could put the datails necessary for the business card.",
			"For the main font, I chose something stylish with a hint of funky to write the name of the business with."
		],
		"thumbnail": "/images/portfolio/placeholder-thumbnail.png",
		"images": [],
		"categories": ["Graphic Design", "Business Card"]
	},
	{
		"id": "returning-stronger",
		"title": "Returning Stronger: A Gibralter Kollel Project",
		"description": [
			"In the year 2020, unfortunately many communities worldwide found themselves unable to keep their synagogues open through the pandemic. In Gibraltar, there was a period of six weeks when all synagogues remained closed, and everyone found themselves unable to pray in a minyan.",
			"When this period of time came to an end, the Gibraltar Kollel started a program where people could sign up and commit to maintaining silence and respect within the synagogues during times of prayer for a month. When people signed up, they would be able to see the names of all the other people who commited.",
			"I was asked to create the website where people would be able to commit to this wonderful initiative, as well as a poster which could be hung up in the synagogue bulletin boards encouraging people to join the program.",
			"The website needed to be completed in short notice, so I made it a single page with a single input for people to submit their names on the top, followed by the list of names of those who were participating so far.",
			"A design concept which came to me early on in the planning of the website was to have an animation where the names would grow as they approaced the middle of the page then shrink again as they left the screen. In order to implement this, I used plain old JavaScript and CSS.",
			"The backend of the website was implement in some very rushed PHP. To save time, and knowing that there weren't going to be absurd amounts of participants, I skipped on storing names in a database and kept everything in a plain text file.",
			"The poster I designed for this project was very similar in style to the website. I used a dark and faded background image which was a combination of photographs from all four of Gibraltar's synagogues."
		],
		"thumbnail": "/images/portfolio/placeholder-thumbnail.png",
		"images": [],
		"categories": [
			"Graphic Design",
			"Website",
			"Poster",
			"PHP",
			"HTML",
			"JavaScript",
			"CSS"
		]
	}
]
